msukanya/lab-iot-reference-stm32u5/Projects/B-U585I-IOT02A/tz_disabled/Src/Common_IO/iot_gpio.c
/*
 * FreeRTOS Common IO V0.1.1
 * Copyright (C) 2020 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://aws.amazon.com/freertos
 * http://www.FreeRTOS.org
 */

/**
 * @file iot_gpio.c
 * @brief HAL GPIO implementation on NRF52840 Development Kit. Note, CommonIO GPIO pin-index-space
 *        is separate from board-specific pin index space. User is expected to provide a 1-to-1 mapping
 *        between these spaces.
 *
 */

#include "FreeRTOS.h"

/* STM Board includes. */
#include "stm32u5xx_hal_gpio.h"
#include "stm32u5xx_hal_gpio_ex.h"
#include "stm32u585xx.h"

/* Common IO includes */
#include "iot_gpio.h"
#include "iot_gpio_config.h"

#include <stdbool.h>

/* Note, this depends on logging task being created and running */
#if ( IOT_GPIO_LOGGING_ENABLED == 1 )
	#include "iot_logging_task.h"
    #define IOT_GPIO_MODULE_NAME    "[CommonIO][GPIO]"
    #define IOT_GPIO_LOGF( format, ... )    vLoggingPrintf( IOT_GPIO_MODULE_NAME format, __VA_ARGS__ )
    #define IOT_GPIO_LOG( msg )             vLoggingPrintf( IOT_GPIO_MODULE_NAME msg )
#else
    #define IOT_GPIO_LOGF( format, ... )
    #define IOT_GPIO_LOG( msg )
#endif

#ifndef IOT_GPIO_INTERRUPT_PRIORITY
	#define IOT_GPIO_INTERRUPT_PRIORITY 3
#endif

typedef enum
{
    IOT_GPIO_CLOSED = 0u,
    IOT_GPIO_OPENED = 1u
} IotGpioState_t;

typedef struct
{
    IotGpioDirection_t xDirection;
    IotGpioOutputMode_t xOutMode;
    int32_t lSpeed;
    IotGpioPull_t xPull;
    IotGpioInterrupt_t xInterruptMode;
    int32_t lFunction;
} IotGpioConfig_t;

/**
 * @brief   GPIO descriptor type defined in the source file.
 */
typedef struct IotGpioDescriptor
{
    int32_t lGpioNumber;
    IotGpioConfig_t xConfig;
    IotGpioCallback_t xUserCallback;
    void * pvUserContext;
    uint8_t ucState;
} IotGpioDescriptor_t;

/*
 * A 1-to-1 mapping set by iot_gpio_config.h. CommonIO Gpio pin index space uses the index i
 * and the board specific identifier is stored at GpioMap[i]. The mapping is user configured.
 */
static const IotMappedPin_t pxGpioMap[] = IOT_COMMON_IO_GPIO_PIN_MAP;
static IotGpioDescriptor_t pxGpioDesc[ IOT_COMMON_IO_GPIO_NUMBER_OF_PINS ];

static const IotGpioDescriptor_t xDefaultGpioDesc =
{
    .lGpioNumber        = -1,
    .xConfig            =
    {
        .xDirection     = eGpioDirectionInput,
        .xOutMode       = eGpioPushPull,
        .lSpeed	        = GPIO_SPEED_FREQ_MEDIUM,
        .xPull          = eGpioPullNone,
        .xInterruptMode = eGpioInterruptNone,
		.lFunction	    = 0u
    },
    .xUserCallback      = NULL,
    .pvUserContext      = NULL,
    .ucState            = IOT_GPIO_CLOSED
};

/*---------------------------------------------------------------------------------*
*                                Private Helpers                                  *
*---------------------------------------------------------------------------------*/

/*
 * @brief   Used to validate whether a CommonIO pin index is a valid argument for iot_gpio_open.
 *          This lGpioNumber will be used to index xGpioDesc and pxGpioMap.
 *
 * @param[in] lGpioNumber CommonIO pin index to validate
 *
 * @return    true if pin is okay to use with iot_gpio_open, else false
 */
static bool prvIsValidPinIndex( int32_t lGpioNumber )
{
    int32_t ulNumberOfMappings = sizeof( pxGpioMap ) == 0 ? 0 : sizeof( pxGpioMap ) / sizeof( pxGpioMap[ 0 ] );

    return ( ulNumberOfMappings > 0 ) &&
           ( ulNumberOfMappings == IOT_COMMON_IO_GPIO_NUMBER_OF_PINS ) &&
           ( 0 <= lGpioNumber && lGpioNumber < ulNumberOfMappings );
}


/*
 * @brief   Used as a first-order check by all API functions that take a IotGpioHandle_t
 *
 * @param[in] pxGpio  IotGpioHandle_t to validate
 *
 * @return    true if handle is available for API interface
 *
 */
static bool prvIsValidHandle( IotGpioHandle_t const pxGpio )
{
    return ( pxGpio != NULL ) && ( pxGpio->ucState == IOT_GPIO_OPENED );
}

/*
 * @brief   Maps CommonIO Drive mode setting to corresponding HAL setting.
 *
 * @param[in] xOutMode      CommonIO setting to map to HAL setting
 * @param{in] xOutMode_NRF  Address to store board HAL specific value hat corresponds with xOutMode
 *
 * @return    true if the xOutMode is within range of valid HAL settings and could map
 *
 */
static int32_t prvGetOutModeForHAL( IotGpioOutputMode_t xOutMode,
                                 uint32_t * xOutMode_STM )
{
    int32_t lReturnCode = IOT_GPIO_SUCCESS;

    switch( xOutMode )
    {
        case eGpioOpenDrain:
            *xOutMode_STM = GPIO_MODE_OUTPUT_OD;
            break;

        case eGpioPushPull:
            *xOutMode_STM = GPIO_MODE_OUTPUT_PP;
            break;

        default:
            lReturnCode = IOT_GPIO_INVALID_VALUE;
    }

    return lReturnCode;
}

static int32_t prvGetSpeedForHAL( int32_t lSpeed,
                               uint32_t * ulSpeed_STM )
{
    int32_t lReturnCode = IOT_GPIO_SUCCESS;

