msukanya/lab-iot-reference-stm32u5/Projects/B-U585I-IOT02A/tz_disabled/Src/Common_IO/iot_gpio.c
    switch( lSpeed )
    {
        case GPIO_SPEED_FREQ_LOW:
        case GPIO_SPEED_FREQ_MEDIUM:
        case GPIO_SPEED_FREQ_HIGH:
        case GPIO_SPEED_FREQ_VERY_HIGH:
            *ulSpeed_STM = lSpeed;
            break;

        default:
            lReturnCode = IOT_GPIO_INVALID_VALUE;
    }

    return lReturnCode;
}

static int32_t prvGetPullForHAL( IotGpioPull_t xPull,
                              uint32_t * xPull_STM )
{
    int32_t lReturnCode = IOT_GPIO_SUCCESS;

    switch( xPull )
    {
        case eGpioPullNone:
            *xPull_STM = GPIO_NOPULL;
            break;

        case eGpioPullUp:
            *xPull_STM = GPIO_PULLUP;
            break;

        case eGpioPullDown:
            *xPull_STM = GPIO_PULLDOWN;
            break;

        default:
            lReturnCode = IOT_GPIO_INVALID_VALUE;
    }

    return lReturnCode;
}

static int32_t prvGetInterruptModeForHAL( IotGpioInterrupt_t xInterrupt,
                                          uint32_t * xInterruptMode_STM )
{
    int32_t lReturnCode = IOT_GPIO_SUCCESS;

    switch( xInterrupt )
    {
        case eGpioInterruptNone:
            break;

        case eGpioInterruptRising:
            *xInterruptMode_STM = GPIO_MODE_IT_RISING;
            break;

        case eGpioInterruptFalling:
            *xInterruptMode_STM = GPIO_MODE_IT_FALLING;
            break;

        case eGpioInterruptEdge:
            *xInterruptMode_STM = GPIO_MODE_IT_RISING_FALLING;
            break;

        case eGpioInterruptLow:
        case eGpioInterruptHigh:
            lReturnCode = IOT_GPIO_FUNCTION_NOT_SUPPORTED;
            IOT_GPIO_LOG( " Warning: This board does not support level-based interrupts.\r\n"
                          "        Similar behaviour can be implemented only using edge-based interrupts\r\n" );
            break;

        default:
            lReturnCode = IOT_GPIO_INVALID_VALUE;
            break;
    }

    return lReturnCode;
}

static int32_t prvGetFunctionForHAL( IotGpioInterrupt_t xFunction,
                                     uint32_t * xFunction_STM )
{
    int32_t lReturnCode = IOT_GPIO_SUCCESS;

    if( IS_GPIO_AF( (uint32_t)xFunction ) )
    {
    	*xFunction_STM = xFunction;
    }
    else
    {
    	lReturnCode = IOT_GPIO_INVALID_VALUE;
    }

	return lReturnCode;
}


/*
 * @brief   This event handler gets installed for all gpio
 *
 * @param[in] xPin STM pin index that had a event triggered.
 *
 */
static void prvPinEventHandler( uint16_t xPin_STM )
{
    IotGpioHandle_t pxGpio = NULL;
    IotMappedPin_t * pxMappedPin = NULL;

    for( int i = 0; i < IOT_COMMON_IO_GPIO_NUMBER_OF_PINS; i++ )
    {
        if( pxGpioMap[ pxGpioDesc[ i ].lGpioNumber ].xPinMask == xPin_STM )
        {
            pxGpio = &pxGpioDesc[ i ];
            pxMappedPin = &pxGpioMap[ pxGpioDesc[ i ].lGpioNumber ];
            break;
        }
    }

    if( ( pxGpio != NULL ) && ( pxGpio->xUserCallback != NULL ) && ( pxGpio->xConfig.xInterruptMode != eGpioInterruptNone ) )
    {
        pxGpio->xUserCallback( (uint8_t)HAL_GPIO_ReadPin( pxMappedPin->xPort, pxMappedPin->xPinMask ), pxGpio->pvUserContext );
    }
}

static void prvEnablePortClock( IotGpioHandle_t const pxGpio )
{
	IotMappedPin_t * pxMappedPin = &pxGpioMap[ pxGpio->lGpioNumber ];
	switch( (uint32_t)pxMappedPin->xPort )
	{
		case (uint32_t)GPIOA:
			__HAL_RCC_GPIOA_CLK_ENABLE();
			break;

		case (uint32_t)GPIOB:
			__HAL_RCC_GPIOB_CLK_ENABLE();
			break;

		case (uint32_t)GPIOC:
			__HAL_RCC_GPIOC_CLK_ENABLE();
			break;

		case (uint32_t)GPIOD:
			__HAL_RCC_GPIOD_CLK_ENABLE();
			break;

		case (uint32_t)GPIOE:
			__HAL_RCC_GPIOE_CLK_ENABLE();
			break;

		case (uint32_t)GPIOF:
			__HAL_RCC_GPIOF_CLK_ENABLE();
			break;

		case (uint32_t)GPIOG:
			__HAL_RCC_GPIOG_CLK_ENABLE();
			break;

		case (uint32_t)GPIOH:
			__HAL_RCC_GPIOH_CLK_ENABLE();
			break;

		case (uint32_t)GPIOI:
			__HAL_RCC_GPIOI_CLK_ENABLE();
			break;

		default:
			break;
	}
}

static void prvEnablePinInterrupt( IotGpioHandle_t const pxGpio )
{
	IotMappedPin_t * pxMappedPin = &pxGpioMap[ pxGpio->lGpioNumber ];
	switch( pxMappedPin->xPinMask )
	{
		case GPIO_PIN_0:
			HAL_NVIC_SetPriority(EXTI0_IRQn, IOT_GPIO_INTERRUPT_PRIORITY, 0);
		    HAL_NVIC_EnableIRQ(EXTI0_IRQn);
			break;

		case GPIO_PIN_1:
			HAL_NVIC_SetPriority(EXTI1_IRQn, IOT_GPIO_INTERRUPT_PRIORITY, 0);
		    HAL_NVIC_EnableIRQ(EXTI1_IRQn);
			break;

		case GPIO_PIN_2:
			HAL_NVIC_SetPriority(EXTI2_IRQn, IOT_GPIO_INTERRUPT_PRIORITY, 0);
		    HAL_NVIC_EnableIRQ(EXTI2_IRQn);
			break;

		case GPIO_PIN_3:
			HAL_NVIC_SetPriority(EXTI3_IRQn, IOT_GPIO_INTERRUPT_PRIORITY, 0);
		    HAL_NVIC_EnableIRQ(EXTI3_IRQn);
			break;

		case GPIO_PIN_4:
			HAL_NVIC_SetPriority(EXTI4_IRQn, IOT_GPIO_INTERRUPT_PRIORITY, 0);
		    HAL_NVIC_EnableIRQ(EXTI4_IRQn);
			break;

		case GPIO_PIN_5:
			HAL_NVIC_SetPriority(EXTI5_IRQn, IOT_GPIO_INTERRUPT_PRIORITY, 0);
		    HAL_NVIC_EnableIRQ(EXTI5_IRQn);
			break;

		case GPIO_PIN_6:
			HAL_NVIC_SetPriority(EXTI6_IRQn, IOT_GPIO_INTERRUPT_PRIORITY, 0);
		    HAL_NVIC_EnableIRQ(EXTI6_IRQn);
			break;

		case GPIO_PIN_7:
			HAL_NVIC_SetPriority(EXTI7_IRQn, IOT_GPIO_INTERRUPT_PRIORITY, 0);
		    HAL_NVIC_EnableIRQ(EXTI7_IRQn);
			break;

		case GPIO_PIN_8:
			HAL_NVIC_SetPriority(EXTI8_IRQn, IOT_GPIO_INTERRUPT_PRIORITY, 0);
		    HAL_NVIC_EnableIRQ(EXTI8_IRQn);
			break;

		case GPIO_PIN_9:
			HAL_NVIC_SetPriority(EXTI9_IRQn, IOT_GPIO_INTERRUPT_PRIORITY, 0);
		    HAL_NVIC_EnableIRQ(EXTI9_IRQn);
			break;

		case GPIO_PIN_10:
			HAL_NVIC_SetPriority(EXTI10_IRQn, IOT_GPIO_INTERRUPT_PRIORITY, 0);
		    HAL_NVIC_EnableIRQ(EXTI10_IRQn);
			break;

		case GPIO_PIN_11:
			HAL_NVIC_SetPriority(EXTI11_IRQn, IOT_GPIO_INTERRUPT_PRIORITY, 0);
		    HAL_NVIC_EnableIRQ(EXTI11_IRQn);
			break;

		case GPIO_PIN_12:
			HAL_NVIC_SetPriority(EXTI12_IRQn, IOT_GPIO_INTERRUPT_PRIORITY, 0);
		    HAL_NVIC_EnableIRQ(EXTI12_IRQn);
			break;

		case GPIO_PIN_13:
			HAL_NVIC_SetPriority(EXTI13_IRQn, IOT_GPIO_INTERRUPT_PRIORITY, 0);
		    HAL_NVIC_EnableIRQ(EXTI13_IRQn);
			break;

		case GPIO_PIN_14:
			HAL_NVIC_SetPriority(EXTI14_IRQn, IOT_GPIO_INTERRUPT_PRIORITY, 0);
		    HAL_NVIC_EnableIRQ(EXTI14_IRQn);
			break;

