msukanya/lab-iot-reference-stm32u5/Projects/B-U585I-IOT02A/tz_disabled/Src/Common_IO/iot_gpio.c
		case GPIO_PIN_15:
			HAL_NVIC_SetPriority(EXTI15_IRQn, IOT_GPIO_INTERRUPT_PRIORITY, 0);
		    HAL_NVIC_EnableIRQ(EXTI15_IRQn);
			break;

		default:
			break;
	}
}

static void prvDisablePinInterrupt( IotGpioHandle_t const pxGpio )
{
	IotMappedPin_t * pxMappedPin = &pxGpioMap[ pxGpio->lGpioNumber ];
	switch( pxMappedPin->xPinMask )
	{
		case GPIO_PIN_0:
		    HAL_NVIC_DisableIRQ(EXTI0_IRQn);
		case GPIO_PIN_1:
		    HAL_NVIC_DisableIRQ(EXTI1_IRQn);
		case GPIO_PIN_2:
		    HAL_NVIC_DisableIRQ(EXTI2_IRQn);
		case GPIO_PIN_3:
		    HAL_NVIC_DisableIRQ(EXTI3_IRQn);
		case GPIO_PIN_4:
		    HAL_NVIC_DisableIRQ(EXTI4_IRQn);
		case GPIO_PIN_5:
		    HAL_NVIC_DisableIRQ(EXTI5_IRQn);
		case GPIO_PIN_6:
		    HAL_NVIC_DisableIRQ(EXTI6_IRQn);
		case GPIO_PIN_7:
		    HAL_NVIC_DisableIRQ(EXTI7_IRQn);
		case GPIO_PIN_8:
		    HAL_NVIC_DisableIRQ(EXTI8_IRQn);
		case GPIO_PIN_9:
		    HAL_NVIC_DisableIRQ(EXTI9_IRQn);
		case GPIO_PIN_10:
		    HAL_NVIC_DisableIRQ(EXTI10_IRQn);
		case GPIO_PIN_11:
		    HAL_NVIC_DisableIRQ(EXTI11_IRQn);
		case GPIO_PIN_12:
		    HAL_NVIC_DisableIRQ(EXTI12_IRQn);
		case GPIO_PIN_13:
		    HAL_NVIC_DisableIRQ(EXTI13_IRQn);
		case GPIO_PIN_14:
		    HAL_NVIC_DisableIRQ(EXTI14_IRQn);
		case GPIO_PIN_15:
		    HAL_NVIC_DisableIRQ(EXTI15_IRQn);
	}
}

/*
 * @brief   Configures a board pin, mapping CommonIO settings to board HAL settings.
 *          Assumes higher-level API verify parameters before making this call.
 *
 * @param[in] pxGpio  Handle with settings to apply to input pin
 * @param[in] pxNewConfig  Tentative new settings for pxGpio
 *
 */
static int32_t prvConfigurePin( IotGpioHandle_t const pxGpio,
                                     const IotGpioConfig_t * const pxNewConfig )
{
    int32_t lReturnCode = IOT_GPIO_SUCCESS;

    /* Validate and map all CommonIO settings to STM HAL settings */
    uint32_t ulPull_STM;
    lReturnCode = prvGetPullForHAL( pxNewConfig->xPull, &ulPull_STM );

    uint32_t ulInterruptMode_STM;
    if( lReturnCode == IOT_GPIO_SUCCESS )
    {
        lReturnCode = prvGetInterruptModeForHAL( pxNewConfig->xInterruptMode, &ulInterruptMode_STM );
    }

    uint32_t ulSpeed_STM;
    if( lReturnCode == IOT_GPIO_SUCCESS )
    {
    	lReturnCode = prvGetSpeedForHAL( pxNewConfig->lSpeed, &ulSpeed_STM );
    }

    uint32_t ulOutMode_STM;
    if( lReturnCode == IOT_GPIO_SUCCESS )
    {
    	lReturnCode = prvGetOutModeForHAL( pxNewConfig->xOutMode, &ulOutMode_STM );
    }

    uint32_t ulFunction_STM;
    if( lReturnCode == IOT_GPIO_SUCCESS )
    {
    	lReturnCode = prvGetFunctionForHAL( pxNewConfig->lFunction, &ulFunction_STM );
    }

    /* Set pin configuration */
    if( lReturnCode == IOT_GPIO_SUCCESS )
    {
        GPIO_InitTypeDef GPIO_InitStruct;
    	IotMappedPin_t * pxMappedPin = &pxGpioMap[ pxGpio->lGpioNumber ];

    	GPIO_InitStruct.Pin = pxMappedPin->xPinMask;
    	GPIO_InitStruct.Pull = ulPull_STM;
    	GPIO_InitStruct.Speed = ulSpeed_STM;
    	GPIO_InitStruct.Alternate = ulFunction_STM;

    	HAL_GPIO_DeInit( pxMappedPin->xPort, pxMappedPin->xPinMask );
        prvDisablePinInterrupt( pxGpio );
        if( pxNewConfig->xDirection == eGpioDirectionInput )
        {
        	if( pxNewConfig->xInterruptMode != eGpioInterruptNone )
        	{
        		GPIO_InitStruct.Mode = ulInterruptMode_STM;
            	HAL_GPIO_Init( pxMappedPin->xPort, &GPIO_InitStruct );
            	prvEnablePinInterrupt( pxGpio );
        	}
        	else
        	{
        		GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
            	HAL_GPIO_Init( pxMappedPin->xPort, &GPIO_InitStruct );
        	}
        }
        else
        {
    		GPIO_InitStruct.Mode = ulOutMode_STM;
        	HAL_GPIO_Init( pxMappedPin->xPort, &GPIO_InitStruct );
        }
    }


    if( lReturnCode == IOT_GPIO_SUCCESS )
    {
        /* Update was successful, update descriptor to reflect new settings */
        pxGpio->xConfig = *pxNewConfig;
    }

    return lReturnCode;
}

/*---------------------------------------------------------------------------------*
*                               API Implementation                                *
*---------------------------------------------------------------------------------*/
IotGpioHandle_t iot_gpio_open( int32_t lGpioNumber )
{
    IotGpioHandle_t xReturnHandle = NULL;

    if( prvIsValidPinIndex( lGpioNumber ) )
    {
        IotGpioHandle_t pxGpio = &pxGpioDesc[ lGpioNumber ];

        if( pxGpio->ucState == IOT_GPIO_CLOSED )
        {
            /* Initialize since descriptor VLA starts as uninitialized */
            *pxGpio = xDefaultGpioDesc;
            pxGpio->lGpioNumber = lGpioNumber;

            if( IOT_GPIO_SUCCESS == prvConfigurePin( pxGpio, &xDefaultGpioDesc.xConfig ) )
            {
            	/* Enable port clocks. Pins share port clocks, so we don't disable upon individual pin closure */
            	prvEnablePortClock( pxGpio );

                /* Claim descriptor */
                pxGpio->ucState = IOT_GPIO_OPENED;
                xReturnHandle = pxGpio;
            }
        }
        else
        {
            IOT_GPIO_LOGF( " Cannot open. GPIO[%d] is already opened\r\n", lGpioNumber );
        }
    }
    else
    {
        IOT_GPIO_LOGF( " Incorrect pin index[%d]. Please verify IOT_COMMON_IO_GPIO_PIN_MAP\r\n", lGpioNumber );
    }

    return xReturnHandle;
}

void iot_gpio_set_callback( IotGpioHandle_t const pxGpio,
                            IotGpioCallback_t xGpioCallback,
                            void * pvUserContext )
{
    if( prvIsValidHandle( pxGpio ) && ( xGpioCallback != NULL ) )
    {
        pxGpio->xUserCallback = xGpioCallback;
        pxGpio->pvUserContext = pvUserContext;
    }
}


int32_t iot_gpio_read_sync( IotGpioHandle_t const pxGpio,
                            uint8_t * pucPinState )
{
    int32_t lReturnCode = IOT_GPIO_SUCCESS;

    if( prvIsValidHandle( pxGpio ) && ( pxGpio->xConfig.xDirection == eGpioDirectionInput ) )
    {
    	IotMappedPin_t * pxMappedPin = &pxGpioMap[ pxGpio->lGpioNumber ];
        *pucPinState = (uint8_t)HAL_GPIO_ReadPin( pxMappedPin->xPort, pxMappedPin->xPinMask );
    }
    else
    {
        lReturnCode = IOT_GPIO_INVALID_VALUE;
    }

    return lReturnCode;
}


