msukanya/lab-iot-reference-stm32u5/Projects/B-U585I-IOT02A/tz_disabled/Src/Common_IO/iot_gpio.c
int32_t iot_gpio_write_sync( IotGpioHandle_t const pxGpio,
                             uint8_t ucPinState )
{
    int lReturnCode = IOT_GPIO_SUCCESS;

    if( prvIsValidHandle( pxGpio ) && ( pxGpio->xConfig.xDirection == eGpioDirectionOutput ) )
    {
    	IotMappedPin_t * pxMappedPin = &pxGpioMap[ pxGpio->lGpioNumber ];
    	HAL_GPIO_WritePin( pxMappedPin->xPort, pxMappedPin->xPinMask, (GPIO_PinState)ucPinState );
    }
    else
    {
        lReturnCode = IOT_GPIO_INVALID_VALUE;
    }

    return lReturnCode;
}

int32_t iot_gpio_close( IotGpioHandle_t const pxGpio )
{
    int32_t lReturnCode = IOT_GPIO_SUCCESS;

    if( prvIsValidHandle( pxGpio ) )
    {
        /* Restore back to default settings. */
    	IotMappedPin_t * pxMappedPin = &pxGpioMap[ pxGpio->lGpioNumber ];

        pxGpio->ucState = IOT_GPIO_CLOSED;
        prvDisablePinInterrupt( pxGpio );
        HAL_GPIO_DeInit( pxMappedPin->xPort, pxMappedPin->xPinMask );

        pxGpio->xConfig = xDefaultGpioDesc.xConfig;
        pxGpio->lGpioNumber = xDefaultGpioDesc.lGpioNumber;
        pxGpio->xUserCallback = xDefaultGpioDesc.xUserCallback;
        pxGpio->pvUserContext = xDefaultGpioDesc.pvUserContext;
    }
    else
    {
        lReturnCode = IOT_GPIO_INVALID_VALUE;
    }

    return lReturnCode;
}

int32_t iot_gpio_ioctl( IotGpioHandle_t const pxGpio,
                        IotGpioIoctlRequest_t xRequest,
                        void * const pvBuffer )
{
    int32_t lReturnCode = IOT_GPIO_INVALID_VALUE;

    if( prvIsValidHandle( pxGpio ) )
    {
        IotGpioConfig_t xNewConfig = pxGpio->xConfig;
        lReturnCode = IOT_GPIO_SUCCESS;

        switch( xRequest )
        {
            case eSetGpioDirection:
                memcpy( &xNewConfig.xDirection, pvBuffer, sizeof( xNewConfig.xDirection ) );
                lReturnCode = prvConfigurePin( pxGpio, &xNewConfig );
                break;

            case eGetGpioDirection:
                memcpy( pvBuffer, &pxGpio->xConfig.xDirection, sizeof( pxGpio->xConfig.xDirection ) );
                break;

            case eSetGpioPull:
                memcpy( &xNewConfig.xPull, pvBuffer, sizeof( xNewConfig.xPull ) );
                lReturnCode = prvConfigurePin( pxGpio, &xNewConfig );
                break;

            case eGetGpioPull:
                memcpy( pvBuffer, &pxGpio->xConfig.xPull, sizeof( pxGpio->xConfig.xPull ) );
                break;

            case eSetGpioOutputMode:
                memcpy( &xNewConfig.xOutMode, pvBuffer, sizeof( xNewConfig.xOutMode ) );
                lReturnCode = prvConfigurePin( pxGpio, &xNewConfig );
                break;

            case eGetGpioOutputType:
                memcpy( pvBuffer, &pxGpio->xConfig.xOutMode, sizeof( pxGpio->xConfig.xOutMode ) );
                break;

            case eSetGpioInterrupt:
                memcpy( &xNewConfig.xInterruptMode, pvBuffer, sizeof( xNewConfig.xInterruptMode ) );
                lReturnCode = prvConfigurePin( pxGpio, &xNewConfig );
                break;

            case eGetGpioInterrupt:
                memcpy( pvBuffer, &pxGpio->xConfig.xInterruptMode, sizeof( pxGpio->xConfig.xInterruptMode ) );
                break;

            case eSetGpioSpeed:
                memcpy( &xNewConfig.lSpeed, pvBuffer, sizeof( xNewConfig.lSpeed ) );
                lReturnCode = prvConfigurePin( pxGpio, &xNewConfig );
                break;

            case eGetGpioSpeed:
                memcpy( pvBuffer, &pxGpio->xConfig.lSpeed, sizeof( pxGpio->xConfig.lSpeed ) );
                break;

            case eSetGpioFunction:
                memcpy( &xNewConfig.lFunction, pvBuffer, sizeof( xNewConfig.lFunction ) );
                lReturnCode = prvConfigurePin( pxGpio, &xNewConfig );
                break;

            case eGetGpioFunction:
                memcpy( pvBuffer, &pxGpio->xConfig.lFunction, sizeof( pxGpio->xConfig.lFunction ) );
                break;

            /* Unsupported functions */
            case eSetGpioDriveStrength:
            case eGetGpioDriveStrength:
            default:
                lReturnCode = IOT_GPIO_FUNCTION_NOT_SUPPORTED;
                IOT_GPIO_LOGF( " Warning: ioctl[%d] is unsupported and was ignored\r\n", xRequest );
                break;
        }
    }

    return lReturnCode;
}

void HAL_GPIO_EXTI_Rising_Callback( uint16_t xPinMask )
{
	prvPinEventHandler( xPinMask );
}

void HAL_GPIO_EXTI_Falling_Callback( uint16_t xPinMask )
{
	prvPinEventHandler( xPinMask );
}

void EXTI0_IRQHandler(void)
{
  HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_0);
}

void EXTI1_IRQHandler(void)
{
  HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_1);
}

void EXTI2_IRQHandler(void)
{
  HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_2);
}

void EXTI3_IRQHandler(void)
{
  HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_3);
}

void EXTI4_IRQHandler(void)
{
  HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_4);
}

void EXTI5_IRQHandler(void)
{
  HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_5);
}

void EXTI6_IRQHandler(void)
{
  HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_6);
}

void EXTI7_IRQHandler(void)
{
  HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_7);
}

void EXTI8_IRQHandler(void)
{
  HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_8);
}

void EXTI9_IRQHandler(void)
{
  HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_9);
}

void EXTI10_IRQHandler(void)
{
  HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_10);
}

void EXTI11_IRQHandler(void)
{
  HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_11);
}

void EXTI12_IRQHandler(void)
{
  HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_12);
}

void EXTI13_IRQHandler(void)
{
  HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_13);
}

void EXTI14_IRQHandler(void)
{
  HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_14);
}

void EXTI15_IRQHandler(void)
{
  HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_15);
}
